src/Documents/уатРекламация_уэ/уатРекламация_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатРекламация_уэ</name>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <basedOn>Document.уатМаршрутныйЛист</basedOn>
  <registerRecords>AccumulationRegister.уатРекламации_уэ</registerRecords>
  <registerRecords>AccumulationRegister.уатНевыставленныеРекламации_уэ</registerRecords>
  <registerRecords>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <comment>Номер входящего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказГрузоотправителя</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.уатРеализацияУслуг</types>
      <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыставленная</name>
    <comment>Сумма рекламации, которая выставлена контрагентом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПодтвержденная</name>
    <comment>Сумма рекламации, которую подтвердила наша организация</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>(Общ) Курс валюты взаиморасчетов по договору</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
        <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
        <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ) Любая дополнительная информация</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/уатНевыставленныеРекламации_уэ/уатНевыставленныеРекламации_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатНевыставленныеРекламации_уэ</name>
  <comment>Невыставленные рекламации (уэ)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказГрузоотправителя</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.уатМаршрутныйЛист</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>По счетам</comment>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаТС</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>CatalogRef.уатПодписи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/уатРекламация_уэ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Claim""';ru='Реестр документов ""Рекламация""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицаЗадолженностьКонтрагентов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРекламации(ДокументСсылка, СтруктураДополнительныеСвойства);
	Если ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист) Тогда
		СформироватьТаблицаНевыставленныеРекламации(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	СформироватьТаблицаОперативныеРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка.ЗаказГрузоотправителя) Тогда
		Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
		
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатНевыставленныеРекламации.ЗаказГрузоотправителя,
		|	уатНевыставленныеРекламации.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.уатНевыставленныеРекламации_уэ.Остатки(
		|			&МоментВремени,
		|			ЗаказГрузоотправителя = &Ссылка
		|				И МаршрутныйЛист = &МаршрутныйЛист) КАК уатНевыставленныеРекламации
		|ГДЕ
		|	ЕСТЬNULL(уатНевыставленныеРекламации.КоличествоОстаток, 0) < 0";
		
		мГраницаКонтроля = Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая);
		
		мЗапрос.УстановитьПараметр("Ссылка"        , ДокументСсылка.ЗаказГрузоотправителя);
		мЗапрос.УстановитьПараметр("МаршрутныйЛист", ДокументСсылка.МаршрутныйЛист);
		мЗапрос.УстановитьПараметр("МоментВремени" , мГраницаКонтроля);
		
		Выборка = мЗапрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстНСТР = СтрШаблон(НСтр("en='According to document ""%1"" has already been entered complaint!';ru='По документу ""%1"" уже была введена рекламация!'"), Выборка.ЗаказГрузоотправителя);
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//  Структура - доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Информация", "Контрагент");
	Результат.Вставить("СуммаДокумента","СуммаПодтвержденная");
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицаЗадолженностьКонтрагентов(ДокументСсылка, СтруктураДополнительныеСвойства)
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &МноговалютныйУчет
	|			ТОГДА уатРекламация_уэРаспределение.Валюта
	|		ИНАЧЕ уатРекламация_уэРаспределение.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	|	уатРекламация_уэРаспределение.Ссылка.Организация КАК Организация,
	|	уатРекламация_уэРаспределение.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	уатРекламация_уэРаспределение.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	уатРекламация_уэРаспределение.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	уатРекламация_уэРаспределение.Сделка КАК Сделка,
	|	0 КАК СуммаУпр,
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	уатРекламация_уэРаспределение.Ссылка КАК Регистратор,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка
	|	И уатРекламация_уэРаспределение.Контрагент ССЫЛКА Справочник.Контрагенты");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МноговалютныйУчет", флМноговалютныйУчет);
	
	ТабЗадолженностиКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	ТабЗадолженностиКонтрагентов.Колонки.Добавить("СделкаВрем"); //тип сделки в ТЧ не содержит Заказ на ТС, а он нам нужен
	
	СтруктураКурсаВалютыДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата);
	СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДокументСсылка.Дата);
	
	// задолженность контрагента перед нами
	Для каждого ТекСтрока Из ТабЗадолженностиКонтрагентов Цикл
		//ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма, 
		//	ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
		//	СтруктураКурсаВалютыДок.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
		//	СтруктураКурсаВалютыДок.Кратность, СтруктураДополнительныеСвойства.КратностьУпр);
		
		Если ДокументСсылка.ВалютаДокумента = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
		Иначе
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов, 
				ТекСтрока.Валюта,                  СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ТекСтрока.КурсВзаиморасчетов,      СтруктураДополнительныеСвойства.КурсУпр,
				ТекСтрока.КратностьВзаиморасчетов, СтруктураДополнительныеСвойства.КратностьУпр);
		КонецЕсли;
												
		Если ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов) Тогда
			ТекСтрока.Сделка = Неопределено;	
		КонецЕсли;
		
		ТекСтрока.СделкаВрем = ТекСтрока.Сделка;
	КонецЦикла;
	
	// наша задолженность перед контрагентом
	Если ТипЗнч(ДокументСсылка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		НовСтрока = ТабЗадолженностиКонтрагентов.Добавить();
		НовСтрока.Период = ДокументСсылка.Дата;
		НовСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		НовСтрока.ДоговорКонтрагента = ДокументСсылка.ДоговорКонтрагента;
		НовСтрока.Валюта             = ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		НовСтрока.Организация        = ДокументСсылка.Организация;
		НовСтрока.Контрагент         = ДокументСсылка.Контрагент;
		Если ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
			НовСтрока.СделкаВрем     = ДокументСсылка.ЗаказГрузоотправителя;
		ИначеЕсли ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			НовСтрока.СделкаВрем     = ДокументСсылка.Сделка;
		КонецЕсли;
		НовСтрока.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ДокументСсылка.СуммаПодтвержденная,
			ДокументСсылка.ВалютаДокумента,    ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов,
			СтруктураКурсаВалютыДок.Курс,      СтруктураКурсаВзаиморасчетов.Курс,
			СтруктураКурсаВалютыДок.Кратность, СтруктураКурсаВзаиморасчетов.Кратность);
			
		НовСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ДокументСсылка.СуммаПодтвержденная, 
			ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураКурсаВалютыДок.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
			СтруктураКурсаВалютыДок.Кратность, СтруктураДополнительныеСвойства.КратностьУпр);
	КонецЕсли;
	
	ТабЗадолженностиКонтрагентов.Колонки.Удалить("Сделка");
	ТабЗадолженностиКонтрагентов.Колонки.СделкаВрем.Имя = "Сделка";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", ТабЗадолженностиКонтрагентов);
КонецПроцедуры

Процедура СформироватьТаблицаРекламации(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.Контрагент КАК Виновник,
	|	уатРекламация_уэРаспределение.СтатьяРасходов КАК СтатьяРасходов,
	|	уатРекламация_уэРаспределение.Ссылка.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист КАК МаршрутныйЛист
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаб = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из мТаб Цикл
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			ДокументСсылка.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			ДокументСсылка.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл);
			
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ДокументСсылка.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			ДокументСсылка.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРекламации", мТаб);
КонецПроцедуры

Процедура СформироватьТаблицаНевыставленныеРекламации(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	уатРекламация_уэ.Ссылка КАК Регистратор,
	|	уатРекламация_уэ.Дата КАК Период,
	|	уатРекламация_уэ.ЗаказГрузоотправителя,
	|	1 КАК Количество,
	|	уатРекламация_уэ.МаршрутныйЛист
	|ИЗ
	|	Документ.уатРекламация_уэ КАК уатРекламация_уэ
	|ГДЕ
	|	уатРекламация_уэ.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	тблДвижения = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНевыставленныеРекламации", тблДвижения);
КонецПроцедуры

Процедура СформироватьТаблицаОперативныеРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.Ссылка КАК Регистратор,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя КАК Заказ,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Ответственный КАК Менеджер,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.Маршрут
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Маршрут
	|	КОНЕЦ КАК Маршрут,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ОбъектСтроительства
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.ОбъектСтроительства
	|	КОНЕЦ КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ВидПеревозки
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.ВидПеревозки
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.НаправлениеПеревозки
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.НаправлениеПеревозки
	|	КОНЕЦ КАК НаправлениеПеревозки,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.Подразделение
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.Подразделение
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ТС КАК ТС,
	|	уатРекламация_уэРаспределение.Ссылка.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.Ссылка.ДоговорКонтрагента КАК Договор,
	|	уатРекламация_уэРаспределение.Ссылка.Организация КАК Организация,
	|	уатРекламация_уэРаспределение.СтатьяРасходов КАК СтатьяРасходов,
	|	1 КАК Количество,
	|	уатРекламация_уэРаспределение.Сумма КАК Сумма,
	|	уатРекламация_уэРаспределение.СуммаНДС КАК СуммаНДС,
	|	уатРекламация_уэРаспределение.СуммаНДС КАК СуммаНДСУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка
	|	И (уатРекламация_уэРаспределение.Контрагент = уатРекламация_уэРаспределение.Ссылка.Организация
	|			ИЛИ уатРекламация_уэРаспределение.Контрагент ССЫЛКА Справочник.ФизическиеЛица)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаРасходы = Запрос.Выполнить().Выгрузить();
	
	// заполнение колонны ТС
	Если ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист) И ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист.ТС) Тогда
		СтруктураМестоТС = уатОбщегоНазначения.МестонахождениеТС(ДокументСсылка.МаршрутныйЛист.ТС, ДокументСсылка.МаршрутныйЛист.Дата);
		Если ЗначениеЗаполнено(СтруктураМестоТС.Колонна) Тогда
			ТаблицаРасходы.Колонки.Добавить("Колонна");
			ТаблицаРасходы.ЗаполнитьЗначения(СтруктураМестоТС.Колонна, "Колонна");
		КонецЕсли;
	КонецЕсли;
		
	КурсДокумента = уатОбщегоНазначенияТиповые.уатКурсДокумента(ДокументСсылка, СтруктураДополнительныеСвойства.ВалютаРеглУчета);
	КратностьДокумента = уатОбщегоНазначенияТиповые.уатКратностьДокумента(ДокументСсылка, СтруктураДополнительныеСвойства.ВалютаРеглУчета);
	
	Для Каждого ТекСтрока Из ТаблицаРасходы Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ДокументСсылка.УчитыватьНДС И НЕ ДокументСсылка.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);
		
		ТекСтрока.СуммаУпр  = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсУпр,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьУпр);
									
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсРегл,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьРегл);
									
		ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсРегл,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьРегл);
			
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсУпр,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьУпр);
	КонецЦикла;
	
	уатРасчетыПоТарифам_уэ.РаспределитьДоходыРасходыМеждуЗаказами(ТаблицаРасходы);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаРасходы);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
